spiricom/stm32f4/drumbox_405_firstIC/Src/waveplayer.c
	// Initialize cycle.
	// initialize audio 
	tCycleInit(&sin1, SAMPLE_RATE, sinewave, SINE_TABLE_SIZE);
	tNoiseInit(&noise1, SAMPLE_RATE, &randomNumber, NoiseTypeWhite);
	tRampInit(&rampFeedback, SAMPLE_RATE, 10.0f, 1);
	tRampInit(&rampSineFreq, SAMPLE_RATE, 10.0f, 1);
	tRampInit(&rampDelayFreq, SAMPLE_RATE, 10.0f, 1);
	tHighpassInit(&highpass1, SAMPLE_RATE, 20.0f);
	tHighpassInit(&highpass2, SAMPLE_RATE, 45.0f);
	tEnvelopeFollowerInit(&envFollowNoise, 0.05, 0.0f);
	tEnvelopeFollowerInit(&envFollowSine, 0.05, 0.0f);
	tDelayInit(&delay1,delayBuffer1);
	tSVFInit(&svf1,SAMPLE_RATE,SVFTypeBandpass, 2000, 1.0f);
	
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); 
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); // ADC CS pin goes high to make sure it's not selected
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_0, GPIO_PIN_SET); // Other IC CS pin goes high to stop conversion
	HAL_Delay(100);
	
#if I2C1_TEST_ENABLED
	while(1) {
		externalDAC_Send();
		HAL_Delay(100);
	}
#endif

#if TEST_LED_ENABLED
	int x,y;
	int timer = 0;
	int toggle = 0;
	while(1) {
		
		setXYLED(x,y);
		
		
		if (timer++ > 100000) {
			toggle = !toggle;
			setTrigOutLED(toggle);
			x += 2; y += 3;
			timer = 0;
		}
		if (x >= 8) x = 0;
		if (y >= 8) y = 0;
			
	}
#endif
	DMA1_externalDACInit();
	HAL_Delay(100);
	//now to send all the necessary messages to the codec
	AudioCodec_init();
	HAL_Delay(100);
	//HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET); 
	
	
	//MX_SPI1_Init();
	//start_Other_IC_Communication();
	
	// set up the I2S driver to send audio data to the codec (and retrieve input as well)	
	//HAL_I2SEx_TransmitReceive_DMA(&hi2s3, (uint16_t*)&Send_Buffer[0], (uint16_t*)&Receive_Buffer[0], AUDIO_BUFFER_SIZE);
	HAL_I2SEx_TransmitReceive_DMA(&hi2s3, (uint16_t *)&Send_Buffer[0], (uint16_t *)&Receive_Buffer[0], AUDIO_BUFFER_SIZE);
  
	//readAndWriteOtherChip(dummy1, dummy2);
	HAL_SPI_TransmitReceive_DMA(&hspi1, IC_tx, IC_rx, IC_BUFFER_SIZE); // removed (uint8_t *) casts before IC_tx and IC_rx
	
/*
  while(1)
	{
		//if(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET)
		//{
			//getXY_Touchpad();
			//Write7SegWave((myTouchpad[0] / 4));
		  spi1tx = HAL_DMA_GetState(&hdma_spi1_tx);
		  mess = spi1tx;
		  spi1rx = HAL_DMA_GetState(&hdma_spi1_rx);
		  mess = spi1rx;
		
		
		//}
	}
	*/
	/*
	while(1)
	{
		if(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_1) == GPIO_PIN_SET)
		{
			getXY_Touchpad();
			//Write7SegWave((myTouchpad[0] / 4));
			
		}
	}
	*/
	//HAL_SPI_TransmitReceive_DMA(&hspi1, (uint8_t *)IC_tx, (uint8_t *)IC_rx, IC_BUFFER_SIZE);
}

uint16_t dacCount1 = 0;
uint16_t dacCount2 = 0;
uint16_t dacCount3 = 0;
uint16_t dacCount4 = 0;
int count = 0;
void audioTick(uint16_t buffer_offset)
{
			uint16_t i = 0;
			int16_t current_sample = 0;  

			getXY_Touchpad();
			uint8_t led_x =(uint8_t)(NUM_LEDS*((float)myTouchpad[0] * INV_TWO_TO_8));
			uint8_t led_y = (uint8_t)(NUM_LEDS*((float)myTouchpad[1] * INV_TWO_TO_8));
			setXYLED(led_x,led_y);
	

			for (i = 0; i < (HALF_BUFFER_SIZE); i++)
			{
				if ((i & 1) == 0)
				{
					current_sample = (int16_t)(audioProcess((float) (Receive_Buffer[HALF_BUFFER_SIZE + i] * INV_TWO_TO_15)) * TWO_TO_15);
				}
				Send_Buffer[buffer_offset + i] = current_sample;
			}
			readExternalADC();
}

#define DACOUT 1
uint8_t newcount = 0;
float audioProcess(float audioIn) {
	
	float Q = 14.9f * (ADC_values[ControlParameterThreshold] * INV_TWO_TO_12) + 0.1f;
	noiseFilterGain = 0.1f*(1.0f - (Q/15.0f))+0.025f;
	svf1.setQ(&svf1, Q);
	svf1.setFreq(&svf1, ADC_values[ControlParameterNoiseDecay]);

	envFollowNoise.decayCoeff(&envFollowNoise,adc1[ADC_values[ControlParameterNoiseDecay]]);
  envFollowSine.decayCoeff(&envFollowSine,adc1[ADC_values[ControlParameterSineDecay]]); 	
	
	//set frequency of sine and delay
	sin1.freq(&sin1, mtof1[(uint16_t)(smoothedParams[ControlParameterFrequency] * 4096.0f)]);
	
	//setDelay(smoothedParams[ControlParameterDelay]);
	delay1.setDelay(&delay1, smoothedParams[ControlParameterDelay]);
	
	
	float newAttackThresh = ((float)ADC_values[ControlParameterThreshold]) * INV_TWO_TO_12 * 0.2f;
	envFollowNoise.attackThresh(&envFollowNoise,newAttackThresh);
  envFollowSine.attackThresh(&envFollowSine,newAttackThresh); 	
	
	
	
	float sineEnv, noiseEnv;
	// MIX
	float sample = 0.8f * audioIn;
	if (ADC_values[ControlParameterFeedback] > 5) {
		sample += (ksGain * ksTick(audioIn));
	}
	if (ADC_values[ControlParameterSineDecay] > 5) {
		
		sineEnv = envFollowSine.tick(&envFollowSine,audioIn); 
		sample += (sineGain * sin1.tick(&sin1) * sineEnv);
		
	}
	sample *= .05f;
	if (ADC_values[ControlParameterNoiseDecay] > 5) {
		
		noiseEnv = envFollowNoise.tick(&envFollowNoise,audioIn); 
		sample += (noiseFilterGain * svf1.tick(&svf1, noise1.tick(&noise1)) * envFollowNoise.tick(&envFollowNoise,audioIn));
	}
	
#if DACOUT
	if (++newcount == 4) {
		newcount = 0;
		externalDACOutputBuffer[0] = 0x50;
	
		uint16_t sineEnvToDAC = (uint16_t)(sineEnv * TWO_TO_12);
		externalDACOutputBuffer[1] = sineEnvToDAC >> 8; 
		externalDACOutputBuffer[2] = (sineEnvToDAC & 255);
	
		uint16_t noiseEnvToDAC = (uint16_t)(noiseEnv * TWO_TO_12);
		externalDACOutputBuffer[3] = noiseEnvToDAC >> 8; 
		externalDACOutputBuffer[4] = (noiseEnvToDAC & 255); 
	
		dacCount3+=3;
		if (dacCount3 >= 4096) {
			dacCount3 = 0;
		}
	
		dacCount4++;
		if (dacCount4 >= 4096) {
			dacCount4 = 0;
		}
	
		externalDACOutputBuffer[5] = (dacCount3 >> 8); 
		externalDACOutputBuffer[6] = (dacCount3 & 255);

		externalDACOutputBuffer[7] = (dacCount4 >> 8); 
		externalDACOutputBuffer[8] = (dacCount4 & 255);
	
		DMA1_externalDACSend();
	}
#endif
	sample *= masterGain;
  sample = highpass1.tick(&highpass1, shaper1[(uint16_t)((sample+1.0f)*0.5f * TWO_TO_15)]);

	//update Parameters
	smoothedParams[ControlParameterFeedback] = rampFeedback.tick(&rampFeedback);
	smoothedParams[ControlParameterFrequency] = rampSineFreq.tick(&rampSineFreq);
	smoothedParams[ControlParameterDelay] = rampDelayFreq.tick(&rampDelayFreq);
	
	return sample;
}


void DMA1_externalDACSend(void) {
	// Start communication with external DAC
	HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, externalDACOutputBuffer, NUM_BYTES_TO_SEND);

