spiricom/stm32f4/drumbox_405_firstIC/Src/waveplayer.c
}

void DMA1_externalDACInit(void) {
	// Start communication with external DAC
	//HAL_I2C_Master_Transmit_DMA(&hi2c1, 192, (uint8_t *)&externalDACOutputBufferTX[0], NUM_BYTES_TO_SEND);

}


void DMA1_TransferCpltCallback (DMA_HandleTypeDef *hdma) {
	for (int i = 5; i < 9; i++) {
		externalDACOutputBufferTX[i] = externalDACOutputBuffer[i];
	}
}

void DMA1_HalfTransferCpltCallback (DMA_HandleTypeDef *hdma) {
	for (int i = 0; i < 5; i++) {
		externalDACOutputBufferTX[i] = externalDACOutputBuffer[i];
	}
}

float clip(float min, float val, float max) {
	
	if (val < min) {
		return min;
	} else if (val > max) {
		return max;
	} else {
		return val;
	}
}

float ksTick(float noise_in)
{
		float temp_sample;
	  
		temp_sample = noise_in + (feedbacksamp * smoothedParams[ControlParameterFeedback]);
		
		//feedbacksamp = delayTick(temp_sample);
		feedbacksamp = delay1.tick(&delay1, temp_sample);
				
	  //simple one-zero lowpass filter (moving average)
		m_output0 = 0.5f * m_input1 + 0.5f * feedbacksamp;
		m_input1 = feedbacksamp;
		feedbacksamp = clip(-1.0f,highpass2.tick(&highpass2,m_output0),1.0f);
		return shaper1[(uint16_t)(((feedbacksamp + 1.0f) * 0.5f) * (TWO_TO_16-1))];
}


void readExternalADC(void)
{
	uint8_t knobnum;
	uint16_t knobval12bit;
	uint16_t knobsendbyte;
	uint8_t ADC_out[2];

	//create the word to send to the knob ADC chips (telling the ADC which channel to scan this time around)
	knobsendbyte = 6208 + (whichKnob << 7);
	ADC_out[0] = knobsendbyte >> 8;
	ADC_out[1] = knobsendbyte & 255;
	
	// write to ADC chip (asking for data on next channel)
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET); // ADC CS pin goes low to initiate conversion
	//for(int j = 0; j < 5000; j++);

	HAL_SPI_TransmitReceive(&hspi2, (uint8_t *)ADC_out, (uint8_t *)ADC_in, ADC_BUFFERSIZE, TIMEOUT);
	//for(int j = 0; j < 5000; j++);

	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET); // ADC CS pin goes high

	knobnum = ADC_in[0] >> 4;
	knobval12bit = (ADC_in[1] | ((ADC_in[0] & 15) << 8));
	ADC_values[knobnum] = knobval12bit;
	
	if (knobnum == ControlParameterFeedback){
		
		newFeedback = interpolateFeedback(ADC_values[ControlParameterFeedback]);
		rampFeedback.setDest(&rampFeedback,newFeedback);
		
	} else if (knobnum == ControlParameterDelay) {
		
		newDelay = interpolateDelayControl((4096 - ADC_values[ControlParameterDelay]));
		rampDelayFreq.setDest(&rampDelayFreq,newDelay);
		
	} else if (knobnum == ControlParameterFrequency) {
		
		newFreq =  (ADC_values[ControlParameterFrequency] * INV_TWO_TO_12) /* * (ADC_values[0] * INV_TWO_TO_12)*/; 
		rampSineFreq.setDest(&rampSineFreq,newFreq);
		
	}

	if (++whichKnob >= NUM_KNOBS)
	{
		whichKnob = 0;
	}
}

float interpolateDelayControl(float raw_data)
{
	float scaled_raw = raw_data * INV_TWO_TO_12;
	if (scaled_raw < 0.2f)
	{
		return (DelayLookup[0] + ((DelayLookup[1] - DelayLookup[0]) * (scaled_raw * 5.f)));
	}
	else if (scaled_raw < 0.6f)
	{
		return (DelayLookup[1] + ((DelayLookup[2] - DelayLookup[1]) * ((scaled_raw - 0.2f) * 2.5f)));
	}
	else
	{
		return (DelayLookup[2] + ((DelayLookup[3] - DelayLookup[2]) * ((scaled_raw - 0.6f) * 2.5f)));
	}	
}
float out;
uint16_t index1;
float delPer;
float w1,w2,range;
float interpolateFeedback(uint16_t idx) {
	
	index1 = idx;
	float delayPeriod = (smoothedParams[ControlParameterDelay] * INV_SAMPLE_RATE);
	delPer = delayPeriod;
	
	
	if (delayPeriod < feedbackDelayPeriod[0]) {
			out = FB1[idx];
	} else if (delayPeriod < feedbackDelayPeriod[1]) {
			// interp between fb[i] and fb[i-1]
			range = feedbackDelayPeriod[1] - feedbackDelayPeriod[0]; 
			w1 = (feedbackDelayPeriod[1] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB1[idx] * w1) + (FB2[idx] * w2); 	
	} else if (delayPeriod < feedbackDelayPeriod[2]) {
		
			range = feedbackDelayPeriod[2] - feedbackDelayPeriod[1]; 
			w1 = (feedbackDelayPeriod[2] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB2[idx] * w1) + (FB3[idx] * w2); 	
	} else if (delayPeriod < feedbackDelayPeriod[3]) {
		
			range = feedbackDelayPeriod[3] - feedbackDelayPeriod[2]; 
			w1 = (feedbackDelayPeriod[3] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB3[idx] * w1) + (FB4[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[4]) {
		
			range = feedbackDelayPeriod[4] - feedbackDelayPeriod[3]; 
			w1 = (feedbackDelayPeriod[4] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB4[idx] * w1) + (FB5[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[5]) {
		
			range = feedbackDelayPeriod[5] - feedbackDelayPeriod[4]; 
			w1 = (feedbackDelayPeriod[5] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB5[idx] * w1) + (FB6[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[6]) {
		
			range = feedbackDelayPeriod[6] - feedbackDelayPeriod[5]; 
			w1 = (feedbackDelayPeriod[6] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB6[idx] * w1) + (FB7[idx] * w2);
	} else if (delayPeriod < feedbackDelayPeriod[7]) {
		
			range = feedbackDelayPeriod[7] - feedbackDelayPeriod[6]; 
			w1 = (feedbackDelayPeriod[7] - delayPeriod)/range;
			w2 = 1.0f - w1; 

			out = (FB7[idx] * w1) + (FB8[idx] * w2);
	}else  {
			out = FB8[idx] ;
	} 
	
	return out;
	

/*
	float scaled_raw = idx * INV_TWO_TO_12;
	if (scaled_raw < 0.2f)
	{
		return (FeedbackLookup[0] + ((FeedbackLookup[1] - FeedbackLookup[0]) * ((scaled_raw) * 5.0f)));
	}		
	else if (scaled_raw < 0.6f)
	{
		return (FeedbackLookup[1] + ((FeedbackLookup[2] - FeedbackLookup[1]) * ((scaled_raw - 0.2f) * 2.5f)));
	}		
	if (scaled_raw < .95f)
	{
		return (FeedbackLookup[2] + ((FeedbackLookup[3] - FeedbackLookup[2]) * ((scaled_raw - 0.6f) * 2.857142857142f)));
	}
	else
	{
		return (FeedbackLookup[3] + ((FeedbackLookup[4] - FeedbackLookup[3]) * ((scaled_raw - 0.95f) * 20.0f )));
	}
*/

}

void Write7SegWave(uint8_t value)
{
	uint8_t Digits[2];
	Digits[0] = value % 10;
	Digits[1] = value / 10;
	
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_11, (GPIO_PinState)(Digits[0] & 1));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_13, (GPIO_PinState)(Digits[0] & 2));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_14, (GPIO_PinState)(Digits[0] & 4));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_15, (GPIO_PinState)(Digits[0] & 8));
	
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_0, (GPIO_PinState)(Digits[1] & 1));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_1, (GPIO_PinState)(Digits[1] & 2));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, (GPIO_PinState)(Digits[1] & 4));
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9, (GPIO_PinState)(Digits[1] & 8));
	
